Revit 2027 API
InitialIlluminanceIntensity.Illuminance Property
 The illuminance intensity value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Illuminance { get; set; }
Public Property Illuminance As Double
	Get
	Set
public:
property double Illuminance {
	double get ();
	void set (double value);
}
member Illuminance : float with get, set
Property Value
Double
 The illuminance value in lx as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The illuminance value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace